# Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.


# Способ 1
def my_func_1(x, y):
    return x ** y


print(my_func_1(2, -5))


# Способ 2
def my_func_2(x, y):
    denominator = x
    for _ in range(abs(y)-1):
        denominator *= x
    return 1 / denominator


print(my_func_2(2, -5))
