# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

# 1. Решение через list
# month = input("Введите номер месяца: ")
month = '6'
month = int(month)
seasons = ["зима", "зима", "весна", "весна", "весна", "лето",
           "лето", "лето", "осень", "осень", "осень", "зима"]
print(f"Время года для {month}-го месяца: {seasons[month-1]}")

# 2. Решение через dict
# month = input("Введите номер месяца: ")
month = '12'
month = int(month)
seasons = {1: "зима", 2: "зима", 3: "весна",
           4: "весна", 5: "весна", 6: "лето",
           7: "лето", 8: "лето", 9: "осень",
           10: "осень", 11: "осень", 12: "зима"}
print(f"Время года для {month}-го месяца: {seasons[month]}")
